import React, { useEffect, useState } from 'react';
import styles from './InformBody.module.scss';

const InformBody = () => {

    let info = sessionStorage.getItem('infoPage');

    const [page, setPage] = useState('');
    const [refresh, setRefresh] = useState(false);

    useEffect(() => {
        const handleClick = () => {
            setRefresh(prevRefresh => !prevRefresh);
        };

        document.addEventListener('click', handleClick);

        return () => {
            document.removeEventListener('click', handleClick);
        };
    }, [refresh]);

    useEffect(() => {
        setPage(info);
    }, [info])

    const aboutUs = [
        'Quick Click - це інноваційна компанія, що пропонує платформу для швидкого та зручного онлайн-торгівлі. Заснована командою фахівців з різних галузей, метою Quick Click є надання споживачам можливості придбати різноманітні товари без зайвих турбот та зусиль.',
        'Ми віримо, що кожен має право на доступ до якісних продуктів, тому працюємо над тим, щоб надати широкий вибір товарів для будь-яких потреб. Наша платформа дозволяє здійснювати покупки в кілька кліків, забезпечуючи споживачам зручність та ефективність.',
        'Однією з наших головних цілей є постійне покращення користувацького досвіду. Ми постійно працюємо над удосконаленням нашої платформи, розробляючи нові функції та вдосконалюючи існуючі сервіси, щоб забезпечити нашим клієнтам максимальну задоволеність від покупок.'
    ];

    const questions = [
        'Які основні переваги використання платформи Quick Click для покупок?',
        'Основними перевагами є швидкість покупок, зручність та доступність широкого асортименту товарів.',
        'Які різновиди товарів можна придбати на платформі Quick Click?',
        'На платформі доступний широкий вибір товарів, включаючи електроніку, моду, косметику, спортивні товари та багато іншого.',
        'Як Quick Click відрізняється від інших онлайн-магазинів?',
        'Quick Click відзначається своєю інноваційністю та простотою використання, а також високою якістю обслуговування та широким вибором товарів.',
        'Які досягнення отримала компанія Quick Click з моменту свого заснування?',
        'Quick Click була відзначена численними нагородами та визнана як один з лідерів у сфері електронної комерції.',
        'Які стратегії компанії Quick Click для подальшого розвитку?',
        'Серед стратегій компанії можуть бути постійне покращення користувацького досвіду, розширення асортименту товарів та підвищення якості обслуговування клієнтів.'
    ];

    if (!page) {
        return <div>Loading...</div>;
    }

    return (
        <div className={styles.inform_body_wrap}>
            <label>{page === 'aboutUs' ? "Про нас" : page === 'questions' ? "Питання та відповіді" : 'Умови використання'}</label>
            {page === 'aboutUs' || page === 'questions' ?
                <ul>
                    {(page === 'aboutUs' ? aboutUs : questions).map((el, i) => (
                        <li className={page === 'questions' ? styles.inform_li_questions : ''} key={i}>{el}</li>

                    ))}
                </ul>
                :
                <div className={styles.inform_div_conditions} >
                    <label>Основні умови використання платформи Quick Click:</label>
                    <ul>
                        <li>
                            <label>1. Реєстрація та обліковий запис:</label>
                            <ul>
                                <li>Користувачі повинні створити обліковий запис для використання платформи Quick Click.</li>
                                <li>При реєстрації необхідно надати точну та повну інформацію про себе.</li>
                                <li>Користувачі відповідають за збереження конфіденційності свого пароля та облікових даних.</li>
                            </ul>
                        </li>
                        <li>
                            <label>2. Поведінка користувачів:</label>
                            <ul>
                                <li>Користувачі повинні використовувати платформу Quick Click згідно з чинним законодавством та правилами.</li>
                                <li>Будь-яка форма зловживання, спаму або неприпустимого вмісту заборонена.</li>
                            </ul>
                        </li>
                        <li>
                            <label>3. Замовлення та оплата:</label>
                            <ul>
                                <li>Користувачі можуть робити замовлення на товари, доступні на платформі Quick Click.</li>
                                <li>Оплата за товари здійснюється відповідно до вказаних на сайті умов.</li>
                            </ul>
                        </li>
                        <li>
                            <label>4. Доставка та повернення:</label>
                            <ul>
                                <li>Quick Click забезпечує доставку замовлень за вказаною адресою.</li>
                                <li>Умови повернення товарів регулюються політикою повернення компанії.</li>
                            </ul>
                        </li>
                        <li>
                            <label>5. Відмова від відповідальності:</label>
                            <ul>
                                <li>Quick Click не несе відповідальності за будь-які прямі або непрямі збитки, що виникли внаслідок використання платформи.</li>
                                <li>Користувачі використовують платформу на власний ризик.</li>
                            </ul>
                        </li>
                        <li>
                            <label>6. Зміни в умовах використання:</label>
                            <ul>
                                <li>Quick Click залишає за собою право змінювати умови використання без попереднього повідомлення.</li>
                            </ul>
                        </li>
                    </ul>
                    <label>На сайті Quick Click діють такі заборони:</label>
                    <ul className={styles.inform_last_ul_conditions}>
                        <li>
                            <div>1.</div>
                            <div>
                                Заборона продажу наркотиків, контрольованих речовин та інших заборонених товарів: Quick Click строго дотримується законодавства щодо продажу товарів і не допускає продаж таких незаконних або заборонених товарів, включаючи наркотики, психотропні речовини, зброю, контрафактні товари та інші незаконні товари.
                            </div>
                        </li>
                        <li>
                            <div>2.</div>
                            <div>
                                Відповідність стандартам якості: Товари, які продаються на Quick Click, повинні відповідати встановленим стандартам якості та безпеці. Це включає в себе якість матеріалів, виробничі процеси, безпеку використання та інші важливі аспекти.
                            </div>
                        </li>
                        <li>
                            <div>3.</div>
                            <div>
                                Правдива інформація про товари: Продавці повинні надавати точну та повну інформацію про свої товари, включаючи їхні характеристики, властивості, умови використання, ціни, умови доставки та повернення.
                            </div>
                        </li>
                        <li>
                            <div>4.</div>
                            <div>
                                Заборона продажу контрафактних товарів: Quick Click рішуче проти допуску продажу контрафактних або підроблених товарів на своїй платформі. Продавці повинні гарантувати, що їхні товари є оригінальними і не порушують права власності.
                            </div>
                        </li>
                        <li>
                            <div>5.</div>
                            <div>
                                Дотримання авторських прав: Продавці повинні забезпечувати, щоб їхні товари не порушували авторські права чи інші права інтелектуальної власності. Це означає, що вони не повинні продавати товари, які мають авторські права без відповідних ліцензій або дозволів.
                            </div>
                        </li>
                        <li>
                            <div>6.</div>
                            <div>
                                Заборона продажу небезпечних товарів: Quick Click не допускає продаж товарів, які можуть становити загрозу здоров'ю або безпеці споживача. Це може включати товари з високим ризиком травматизму, неякісні або шкідливі товари, а також товари з неправильною маркуванням щодо їх безпеки.
                            </div>
                        </li>
                    </ul>
                    <label>
                        Користуючись платформою Quick Click, користувач погоджується з усіма вищезазначеними умовами. Невиконання цих умов може призвести до обмеження доступу до платформи або відмови в обслуговуванні.
                    </label>
                </div>
            }
            <label>{page === 'aboutUs' ? "Наші контакти" : "Маєш додаткові питання?"}</label>
            <ul className={styles.inform_last_ul}>
                <li>Пн - Нд: 08:00 - 20:00</li>
                <li>+38 (096) 044 95 95</li>
                <li>+38 (050) 044 95 95</li>
                <li>contactus@quickclick.ua</li>
            </ul>
            <label>Переглянути каталог</label>
        </div >
    );
}

export default InformBody;